# SQL Queries 9

In [1]:
import pymysql
from sqlalchemy import create_engine, text
import pandas as pd

import getpass

### 1. Create a Python connection with SQL database

Retrieve the results of the following two queries as dataframes:

- Check the number of rentals for each customer for May
- Check the number of rentals for each customer for June

Hint: You can store the results from the two queries in two separate dataframes.

In [2]:
password = getpass.getpass()

 ········

In [39]:
connection_string = 'mysql+pymysql://root:'+password+'@localhost/sakila'
engine = create_engine(connection_string)

In [40]:
query = "SELECT CONCAT(c.first_name, ' ', c.last_name) AS `customer`, COUNT(r.rental_id) AS rentals_may \
FROM customer AS c \
LEFT JOIN rentals_may AS r \
ON c.customer_id = r.customer_id \
GROUP BY `customer` \
ORDER BY 2 DESC;"

In [41]:
may_df = pd.read_sql_query(sql = text(query), con= engine.connect())
may_df

           customer  rentals_may
0        SUE PETERS            8
1         EDNA WEST            7
2     LESLIE SEWARD            7
3     RUTH MARTINEZ            6
4    HEATHER MORRIS            6
..              ...          ...
594  MARSHALL THORN            0
595  PERRY SWAFFORD            0
596  KENT ARSENAULT            0
597  TERRANCE ROUSH            0
598   WADE DELVALLE            0

[599 rows x 2 columns]

In [42]:
query2 = "SELECT CONCAT(c.first_name, ' ', c.last_name) AS `customer`, COUNT(r.rental_id) AS rentals_june \
FROM customer AS c \
LEFT JOIN rentals_june AS r \
ON c.customer_id = r.customer_id \
GROUP BY `customer` \
ORDER BY 2 DESC;"

In [43]:
june_df = pd.read_sql_query(sql = text(query2), con= engine.connect())
june_df

            customer  rentals_june
0      BRENDA WRIGHT            11
1       ALEX GRESHAM            10
2    GINA WILLIAMSON             9
3        MARGIE WADE             9
4        DAISY BATES             9
..               ...           ...
594    TONY CARRANZA             0
595         DON BONE             0
596    BERNARD COLBY             0
597   MICHEAL FORMAN             0
598   PEDRO CHESTNUT             0

[599 rows x 2 columns]

### 2. Write a function

Checks if customer borrowed more or less films in the month of June as compared to May.

Hint: For this part, you can create a join between the two dataframes created before, using the merge function available for pandas dataframes. Here is a link to the documentation for the merge function.

In [118]:
merge_df = pd.merge(may_df, june_df, how='inner', on='customer', sort=False)
merge_df.head(20)

             customer  rentals_may  rentals_june
0          SUE PETERS            8             8
1           EDNA WEST            7             5
2       LESLIE SEWARD            7             5
3       RUTH MARTINEZ            6             3
4      HEATHER MORRIS            6             5
5   GERALDINE PERKINS            6             2
6   GERTRUDE CASTILLO            6             1
7       MINNIE ROMERO            6             5
8        COURTNEY DAY            6             3
9       VICKIE BREWER            6             3
10  CASSANDRA WALTERS            6             3
11     NAOMI JENNINGS            6             2
12       BILLY POULIN            6             7
13   ENRIQUE FORSYTHE            6             2
14       MARIA MILLER            5             5
15        BETTY WHITE            5             1
16       MARIE TURNER            5             4
17      DIANE COLLINS            5             4
18       JANE BENNETT            5             5
19       JUNE CARROLL            5             8

In [131]:
def rent_comparison (customer, df):
    
    data = df.loc[df['customer'] == customer]
    if len(data) == 0:
        return f"No se encontró información para el cliente {customer}"
    
    rentals_may = data['rentals_may'].iloc[0]
    rentals_june = data['rentals_june'].iloc[0]
    
    if rentals_june > rentals_may:
        return f"El cliente {customer} tomó más películas en junio ({rentals_june}) que en mayo ({rentals_may})."
    elif rentals_june < rentals_may:
        return f"El cliente {customer} tomó menos películas en junio ({rentals_june}) que en mayo ({rentals_may})."
    else:
        return f"El cliente {customer} tomó la misma cantidad de películas en junio ({rentals_june}) que en mayo ({rentals_may})."

In [132]:
rent_comparison('BRENDA WRIGHT', merge_df)

'El cliente BRENDA WRIGHT tomó más películas en junio (11) que en mayo (0).'

In [133]:
rent_comparison('JANE BENNETT', merge_df)

'El cliente JANE BENNETT tomó la misma cantidad de películas en junio (5) que en mayo (5).'

In [134]:
rent_comparison('RUTH MARTINEZ', merge_df)

'El cliente RUTH MARTINEZ tomó menos películas en junio (3) que en mayo (6).'

In [135]:
rent_comparison('DANIEL RETANA', merge_df)

'No se encontró información para el cliente DANIEL RETANA'